Tekla Open API Reference for Tekla Structures 2025
WpfMaterialCatalog Events
The WpfMaterialCatalog type exposes the following members.
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
WpfMaterialCatalog Class
Tekla.Structures.Dialog.UIControls Namespace